[{
    "title": "AOT: The Final Season",
    "rating": "9.0/10",
    "description": "Attack on Titan: The Final Season concludes the epic saga of humanity's battle against the Titans, uncovering long-hidden truths about the world and the origins of the Titans. The season delves into political conflicts, moral dilemmas, and the struggle for freedom as Eren Yeager takes a darker path to achieve his goals.",
    "releaseDate": "2020-12-07",
    "actors": "Yuki Kaji, Yui Ishikawa, Marina Inoue, Takehito Koyasu",
    "image": "https://m.media-amazon.com/images/M/MV5BNjY4MDQxZTItM2JjMi00NjM5LTk0MWYtOTBlNTY2YjBiNmFjXkEyXkFqcGc@._V1_FMjpg_UX1000_.jpg",
    "trailer":"https://www.youtube.com/embed/sBLsE-NKEoI"
  },
  {
    "title": "I Am Not Okay with This",
    "rating": "7.5/10",
    "description": "I Am Not Okay with This is a coming-of-age black comedy series that follows Sydney Novak, a teenage girl navigating the complexities of high school, family dynamics, and her emerging sexuality, all while discovering she has mysterious superpowers. Based on Charles Forsman's graphic novel, the show blends adolescent angst with supernatural elements.",
    "releaseDate": "2020-02-26",
    "actors": "Sophia Lillis, Wyatt Oleff, Sofia Bryant, Kathleen Rose Perkins",
    "image": "https://m.media-amazon.com/images/M/MV5BOTVkYzBlNjMtNmMyMi00ZDM3LWFlMDctZmMxOWU5NWM2MmRhXkEyXkFqcGc@._V1_.jpg",
    "trailer":"https://www.youtube.com/embed/BmXxfsZPeu0"
  },{
    "title": "Fullmetal Alchemist: Brotherhood",
    "rating": "9.1/10",
    "description": "Fullmetal Alchemist: Brotherhood is a Japanese anime series that follows brothers Edward and Alphonse Elric, who use alchemy in their quest to find the Philosopher's Stone to restore their bodies after a failed alchemical experiment. The series is acclaimed for its intricate plot and philosophical themes.",
    "releaseDate": "2009-04-05",
    "actors": "Romi Park, Rie Kugimiya, Megumi Takamoto, Shin'ichirô Miki",
    "image": "https://m.media-amazon.com/images/M/MV5BMzNiODA5NjYtYWExZS00OTc4LTg3N2ItYWYwYTUyYmM5MWViXkEyXkFqcGc@._V1_.jpg",
    "trailer":"https://www.youtube.com/embed/kx0nBaS_q50"
  },
  
  {
    "title": "Vinland Saga",
    "rating": "8.8/10",
    "description": "Vinland Saga is a Japanese anime series that chronicles the journey of Thorfinn, a young Viking warrior seeking revenge against the mercenary leader who killed his father. Set in medieval Europe, the series blends historical events with intense action and deep character development.",
    "releaseDate": "2019-07-07",
    "actors": "Yûto Uemura, Kenshô Ono, Akio Ôtsuka, Naoya Uchida",
    "image": "https://m.media-amazon.com/images/M/MV5BNDA3MGNmZTEtMzFiMy00ZmViLThhNmQtMjQ4ZDc5MDEyN2U1XkEyXkFqcGc@._V1_.jpg",
    "trailer":"https://www.youtube.com/embed/f8JrZ7Q_p-8"
  },
  {
    "title": "Friends",
    "rating": "8.9/10",
    "description": "Friends is a beloved American sitcom that aired from 1994 to 2004, following the lives of six friends—Rachel, Ross, Monica, Chandler, Joey, and Phoebe—as they navigate personal and professional challenges in New York City. The show is celebrated for its humor, memorable characters, and cultural impact.",
    "releaseDate": "1994-09-22",
    "actors": "Jennifer Aniston, Courteney Cox, Lisa Kudrow, Matt LeBlanc, Matthew Perry, David Schwimmer",
    "image": "https://m.media-amazon.com/images/M/MV5BOTU2YmM5ZjctOGVlMC00YTczLTljM2MtYjhlNGI5YWMyZjFkXkEyXkFqcGc@._V1_FMjpg_UX1000_.jpg",
    "trailer":"https://www.youtube.com/embed/LSqf52PIalA"
  },
  {
    "title": "Rick and Morty",
    "rating": "9.2/10",
    "description": "Rick and Morty is an animated science fiction sitcom that follows the misadventures of cynical mad scientist Rick Sanchez and his good-hearted but fretful grandson Morty Smith as they navigate complex and dangerous adventures across the multiverse.",
    "releaseDate": "2013-12-02",
    "actors": "Justin Roiland, Chris Parnell, Spencer Grammer, Sarah Chalke",
    "image": "https://m.media-amazon.com/images/M/MV5BZGQyZjk2MzMtMTcyNC00NGU3LTlmNjItNDExMWM4ZDFhYmQ2XkEyXkFqcGc@._V1_FMjpg_UX1000_.jpg",
    "trailer":"https://www.youtube.com/embed/EWSaCitNyIs"
  },
  {
    "title": "Arcane",
    "rating": "9.0/10",
    "description": "Arcane is an animated series set in the League of Legends universe, exploring the origin stories of iconic characters from the utopian city of Piltover and the oppressed underground of Zaun. The series is praised for its stunning animation and deep storytelling.",
    "releaseDate": "2021-11-06",
    "actors": "Hailee Steinfeld, Kevin Alejandro, Jason Spisak, Ella Purnell",
    "image": "https://m.media-amazon.com/images/M/MV5BOWJhYjdjNWEtMWFmNC00ZjNkLThlZGEtN2NkM2U3NTVmMjZkXkEyXkFqcGc@._V1_FMjpg_UX1000_.jpg",
    "trailer":"https://www.youtube.com/embed/g-6g2uEjF1s"
  },
  {
    "title": "True Detective",
    "rating": "9.0/10",
    "description": "True Detective is an anthology crime drama series where each season introduces new narratives and characters, delving into complex investigations and the personal and professional challenges faced by those involved. The series is known for its compelling storytelling and strong performances.",
    "releaseDate": "2014-01-12",
    "actors": "Matthew McConaughey, Woody Harrelson, Michelle Monaghan, Colin Farrell",
    "image": "https://m.media-amazon.com/images/M/MV5BYjgwYzA1NWMtNDYyZi00ZGQyLWI5NTktMDYwZjE2OTIwZWEwXkEyXkFqcGc@._V1_.jpg",
    "trailer":"https://www.youtube.com/embed/fVQUcaO4AvE"
  },
  {
    "title": "The Last of Us",
    "rating": "9.2/10",
    "description": "The Last of Us is a post-apocalyptic drama series based on the acclaimed video game, following the journey of Joel and Ellie as they navigate a world ravaged by a fungal pandemic. The series explores themes of survival, trust, and the bonds formed in dire circumstances.",
    "releaseDate": "2023-01-15",
    "actors": "Pedro Pascal, Bella Ramsey, Gabriel Luna, Merle Dandridge",
    "image": "https://m.media-amazon.com/images/M/MV5BY2JiNjU3NWYtMTRlYS00NzY3LWE2NDQtZGFkNWE2MDU4OTExXkEyXkFqcGc@._V1_FMjpg_UX1000_.jpg",
    "trailer":"https://www.youtube.com/embed/uLtkt8BonwM"
  },
  {
    "title": "Berserk (1997)",
    "rating": "8.7/10",
    "description": "Berserk is a dark fantasy anime series that follows Guts, a skilled swordsman, as he joins the mercenary group known as the Band of the Hawk, led by the charismatic Griffith. The series delves into themes of ambition, fate, and the human condition.",
    "releaseDate": "1997-10-07",
    "actors": "Nobutoshi Canna, Marc Diraison, Carrie Keranen, Kevin T. Collins",
    "image": "https://m.media-amazon.com/images/M/MV5BZmE1YTFlZWMtYzRkYi00MWU0LWIwODctZmYzMDExZGRkM2NmXkEyXkFqcGc@._V1_FMjpg_UX1000_.jpg",
    "trailer":"https://www.youtube.com/embed/GZFNRMV8IdQ"
  },
  {
    "title": "The Mandalorian",
    "rating": "8.8/10",
    "description": "The Mandalorian is a space Western series set in the Star Wars universe, following the adventures of a lone bounty hunter known as the Mandalorian as he navigates the outer reaches of the galaxy, protecting a mysterious child from various threats.",
    "releaseDate": "2019-11-12",
    "actors": "Pedro Pascal, Gina Carano, Carl Weathers, Giancarlo Esposito",
    "image": "https://m.media-amazon.com/images/M/MV5BNjgxZGM0OWUtZGY1MS00MWRmLTk2N2ItYjQyZTI1OThlZDliXkEyXkFqcGc@._V1_FMjpg_UX1000_.jpg",
    "trailer":"https://www.youtube.com/embed/aOC8E8z_ifw"
  },
  {
    "title": "Hunter x Hunter",
    "rating": "9.0/10",
    "description": "Hunter x Hunter is a Japanese anime series that follows Gon Freecss, a young boy who becomes a Hunter to find his absentee father. Along the way, he befriends other aspiring Hunters and faces various challenges in a world filled with adventure and danger.",
    "releaseDate": "2011-10-02",
    "actors": "Megumi Han, Mariya Ise, Keiji Fujiwara, Miyuki Sawashiro",
    "image": "https://m.media-amazon.com/images/M/MV5BYzYxOTlkYzctNGY2MC00MjNjLWIxOWMtY2QwYjcxZWIwMmEwXkEyXkFqcGc@._V1_.jpg",
    "trailer":"https://www.youtube.com/embed/d6kBeJjTGnY"
  },
  {
    "title": "Avatar The Last Airbender",
    "rating": "9.3/10",
    "description": "Avatar: The Last Airbender is an animated series set in a world where people can manipulate the elements of water, earth, fire, and air. The story follows Aang, the last Airbender and the Avatar, as he embarks on a quest to bring balance to the world.",
    "releaseDate": "2005-02-21",
    "actors": "Zach Tyler, Mae Whitman, Jack De Sena, Dante Basco",
    "image": "https://m.media-amazon.com/images/M/MV5BMDMwMThjYWYtY2Q2OS00OGM2LTlkODQtNDJlZTZmMjAyYmFhXkEyXkFqcGc@._V1_FMjpg_UX1000_.jpg",
    "trailer":"https://www.youtube.com/embed/ooVvH2IYz0w"
  },
  {
    "title": "Dark",
    "rating": "8.7/10",
    "description": "Dark is a German science fiction thriller series that explores the implications of time travel on human nature. The story follows four interconnected families as they uncover a time travel conspiracy that spans several generations.",
    "releaseDate": "2017-12-01",
    "actors": "Louis Hofmann, Karoline Eichhorn, Lisa Vicari, Maja Schöne",
    "image": "https://m.media-amazon.com/images/M/MV5BM2RhZGVlZGItMGZiMy00YjdjLWIwMGUtMWYxOGIwNjA0MjNmXkEyXkFqcGc@._V1_FMjpg_UX1000_.jpg",
    "trailer":"https://www.youtube.com/embed/rrwycJ08PSA"
  },
  {
    "title": "Daredevil",
    "rating": "8.6/10",
    "description": "Daredevil is a Marvel series that follows Matt Murdock, a blind lawyer by day and vigilante by night, as he fights crime in New York City's Hell's Kitchen. The show is known for its gritty portrayal of the superhero genre and complex character development.",
    "releaseDate": "2015-04-10",
    "actors": "Charlie Cox, Deborah Ann Woll, Elden Henson, Vincent D'Onofrio",
    "image": "https://m.media-amazon.com/images/M/MV5BODcwOTg2MDE3NF5BMl5BanBnXkFtZTgwNTUyNTY1NjM@._V1_.jpg",
    "trailer":"https://www.youtube.com/embed/jAy6NJ_D5vU"
  },
  {
    "title": "House of the Dragon",
    "rating": "8.4/10",
    "description": "House of the Dragon is a fantasy drama series that serves as a prequel to 'Game of Thrones.' It chronicles the history of House Targaryen, focusing on the events leading up to and during the Targaryen civil war known as the Dance of the Dragons.",
    "releaseDate": "2022-08-21",
    "actors": "Paddy Considine, Emma D'Arcy, Matt Smith, Olivia Cooke",
    "image": "https://m.media-amazon.com/images/M/MV5BM2QzMGVkNjUtN2Y4Yi00ODMwLTg3YzktYzUxYjJlNjFjNDY1XkEyXkFqcGc@._V1_FMjpg_UX1000_.jpg",
    "trailer":"https://www.youtube.com/embed/DotnJ7tTA34"
  },
  {
    "title": "The Queen's Gambit",
    "rating": "8.6/10",
    "description": "The Queen's Gambit is a coming-of-age period drama that follows Beth Harmon, an orphaned chess prodigy, as she rises to prominence in the male-dominated world of competitive chess while struggling with addiction and personal challenges.",
    "releaseDate": "2020-10-23",
    "actors": "Anya Taylor-Joy, Bill Camp, Marielle Heller, Thomas Brodie-Sangster",
    "image": "https://m.media-amazon.com/images/M/MV5BMmRlNjQxNWQtMjk1OS00N2QxLTk0YWQtMzRhYjY5YTFhNjMxXkEyXkFqcGc@._V1_FMjpg_UX1000_.jpg",
    "trailer":"https://www.youtube.com/embed/oZn3qSgmLqI"
  },
  {
    "title": "Loki",
    "rating": "8.2/10",
    "description": "Loki is a Marvel series that follows the God of Mischief after the events of 'Avengers: Endgame.' The show explores Loki's adventures across different timelines and his involvement with the Time Variance Authority, an organization that monitors the multiverse.",
    "releaseDate": "2021-06-09",
    "actors": "Tom Hiddleston, Owen Wilson, Gugu Mbatha-Raw, Sophia Di Martino",
    "image": "https://m.media-amazon.com/images/M/MV5BM2FiMjQ0ZjAtYzc1OC00NzgzLWIyNmQtYmIwYjdhZWM5MmRiXkEyXkFqcGc@._V1_FMjpg_UX1000_.jpg",
    "trailer":"https://www.youtube.com/embed/nW948Va-l10"
  },
  {
    "title": "Over the Garden Wall",
    "rating": "8.8/10",
    "description": "Over the Garden Wall is an animated miniseries that follows two half-brothers, Wirt and Greg, as they become lost in a mysterious forest called The Unknown and attempt to find their way home, encountering various strange and whimsical characters along the way.",
    "releaseDate": "2014-11-03",
    "actors": "Elijah Wood, Collin Dean, Melanie Lynskey, Christopher Lloyd",
    "image": "https://m.media-amazon.com/images/M/MV5BOTA2MTdhZmItODM3NS00ZmFlLWE4YWYtOWYxODBmNGU5YjRjXkEyXkFqcGc@._V1_.jpg",
    "trailer":"https://www.youtube.com/embed/36mAsVSH_-s"
  },
  {
    "title": "Regular Show",
    "rating": "8.4/10",
    "description": "Regular Show is an animated series that follows the daily lives of two friends, Mordecai, a blue jay, and Rigby, a raccoon, who work as groundskeepers at a park. Their attempts to avoid work and seek out fun lead to surreal and often supernatural adventures.",
    "releaseDate": "2010-09-06",
    "actors": "J.G. Quintel, William Salyers, Sam Marin, Mark Hamill",
    "image": "https://m.media-amazon.com/images/M/MV5BNDJlMGI1MDYtZDM0MS00NDYzLWIyMmUtZTY5MjY3MzJiN2QwXkEyXkFqcGc@._V1_.jpg",
    "trailer":"https://www.youtube.com/embed/Mm-Zc1_I1_8"
  },
  {
    "title": "Utopia",
    "rating": "8.4/10",
    "description": "The six-episode conspiracy drama from writer Dennis Kelly pivots around a mysterious cult graphic novel called `The Utopia Experiments', which attracts a large following of fans who gather online to talk about it.",
    "releaseDate": "2013-01-15",
    "actors": "Alexandra Roach , Adeel Akhtar , Paul Higgins , Fiona O'Shaughnessy",
    "image": "https://encrypted-tbn2.gstatic.com/images?q=tbn:ANd9GcRglwv_Olkl9t2dEf7jxAxU6Qpu_P5KJXUAGi7_RNZGZOHlwT75w352GBzZ33aoi3_TXI0fMA",
    "trailer":"https://www.youtube.com/embed/LVLKWhLNuZk"
  }
]